In [2]:
'''Write a Pandas program to create a Pivot table and find the total sale amount region wise, manager wise, sales man wise.'''
import pandas as pd     #importing pandas library as pd
import numpy as np      #importing numpy library as np

In [18]:
#read the csv file into the DataFrame
df = pd.read_csv("salesdata.csv")     #csv file named "salesdata.csv" is saved in the folder
df.head()

    Region  Manager   SalesMan          Item  Units  Unit_price  Sale_amt
0     East   Martha  Alexander    Television     95      1198.0  113810.0
1  Central  Hermann     Shelli  Home Theater     50       500.0   25000.0
2  Central  Hermann       Luis    Television     36      1198.0   43128.0
3  Central  Timothy      David    Cell Phone     27       225.0    6075.0
4     West  Timothy    Stephen    Television     56      1198.0   67088.0

In [17]:
#creating a Pivot table and finding the total sale amount region,manager and sales man wise
round(pd.pivot_table(df,index=['Region','Manager','SalesMan'],values=['Sale_amt'],aggfunc=['sum']))

                                sum
                           Sale_amt
Region  Manager SalesMan
Central Douglas John       124016.0
        Hermann Luis       206373.0
                Shelli      33698.0
                Sigal      125038.0
        Marth   Steven      14000.0
        Martha  Steven     185690.0
        Timothy David      140955.0
East    Douglas Karen       48204.0
        Martha  Alexander  236703.0
                Diana       36100.0
West    Douglas Michael     66836.0
        Timothy Stephen     88063.0